
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/AI1411/terraform-ecs/actions/runs/4623950922)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-01e8f0711944f630e]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e045ce1b00c1ae71]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09546da07a4d3a277]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b14a6d3c53e3d5f7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08bd2e8d1f95541a0]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-034910cb1cab13f5d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02b5539fe45e6327b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02e8ee5062f5fe950]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-03b1e0e9db27f8104]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04f10a644e50be262]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0d3200ffc3ea6afea]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0e9905288523882a7]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0053b16448220511f]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-03b1e0e9db27f81041080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-017b30897b472f820]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dc05b5fb1b3132df]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bf2e0c94a12ca98a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-018706a2db074f9f1]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0d3200ffc3ea6afea1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04f10a644e50be2621080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic from the internet to the ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from the internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "golang-simple-grpc-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "golang-simple-grpc-server-alb"
        }
      + tags_all               = {
          + "Name" = "golang-simple-grpc-server-alb"
        }
      + vpc_id                 = "vpc-0e045ce1b00c1ae71"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic from the ALB to the ECS instances"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "golang-simple-grpc-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "golang-simple-grpc-server-ecs"
        }
      + tags_all               = {
          + "Name" = "golang-simple-grpc-server-ecs"
        }
      + vpc_id                 = "vpc-0e045ce1b00c1ae71"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow inbound traffic from the ALB to the ECS instances"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-072ed778c4dcf4979]
aws_security_group.alb: Creation complete after 4s [id=sg-0913f06e7e46d9d88]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 2s [id=sgrule-1318507288]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"ce6a5c836fe5762ca0bda8ac361117092f883e8f","Vars":{},"WorkflowName":"Terraform"} -->